praetorian555/Baywatchers/Software/Embedded Software/Motion Board/stm32f10x_it_stu.c
/**
******************************************************************************
* @file    Examples/GPIOToggle/stm32f10x_it.c 
* @author  MCD Application Team
* @version V1.0.0
* @date    15/09/2010
* @brief   Main Interrupt Service Routines.
*          This file provides template for all exceptions handler and peripherals
*          interrupt service routine.
******************************************************************************
* @copy
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
* TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
* DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
* FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
* CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* <h2><center>&copy; COPYRIGHT 2010 STMicroelectronics</center></h2>
*/

/* Includes ------------------------------------------------------------------*/
#include "UartDebug.h"
#include "print.h"
#include "stm32f10x_it.h"
#include "STM32vldiscovery.h"
#include "continous_movement.h"

#include "variables.h"


#include <math.h>
#define PI 3.14159265
#define CTM 1
#define MTC 1
#define CTU 0.03076923076//0.03783538289
#define UTC 32.5 //31.55
#define STC 281.6976
#define forwardConstant 1
#define MAX_TRANSX_LEN 200
#define ADDR 0x0A
#define SCALE 1
#define MEASUREMENT_NUM 5          // Broj merenja, nakon cega se racuna srednja vrednost.
#define ECHO_TIMER_PERIOD 50000    // Period tajmera koji meri echo.
#define CONST_MICRO_SEC_TO_MM 5.8  // Konstanta za pretvaranje us u mm.
#define MAX_DISTANCE_MM 300        // Rastojanje koje se detektuje kada treba da se zaustavimo. 
#define STOP_DISTANCE 0
#define PROXIMITY_CONSTANT 10   

//#define angularConstant 0.00798226//0.01538461538//0.01891769144// ovo se dobija kao 180/broj impulsa za rotaciju

// DODATO, STATUS ROBOTA
int robot_status = 0;

typedef struct{
  long x;
  long y;
  int theta;
}absPosition;
/** @addtogroup Examples
* @{
*/

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
char state = 0;
//extern unsigned long ENC1, ENC2, ENC1_old, ENC2_old;
int err = 0;
static absPosition apsolutnaPozicija={.x=0, .y=0, .theta=0};
extern int brojac, brzina,prethodna_greska1, prethodna_greska2;

extern float Kp,Ki,Kd,Int1, Int2;
int x;  //temp promenljiva za pomeraj
extern float Kp_poz,Ki_poz,Kd_poz,Int_poz;
extern volatile unsigned int Pos1, Pos2;        //Pozicije motora, za sad
extern int prethodna_greska_poz;
extern int speed_ref_pos[10];
int byte_counter = 0;
int message_size = -1;
int znak = 1;
char komanda;
int enkoder1=0;
int enkoder2=0;
bool pocetak_prijema = 0;
bool stigao, stigao1 = 0;
int cnt_90 = 0;

static int neki_brojac=0;
static int sending_array[260];
static int sending_length=0;
static int sending_iterator=0;

bool ulm_received=0; //unknown length message received
int ulm_length=0;
///stefan
bool advanced_segment_stigao=FALSE;
int bajt=0;
int cmd_counter=1;
extern long putanja[100][2];
extern int flag_a;
extern int putanja_counter;
////// ende stefan



extern int flag_c;
Coordinates polyline_path[50];
int polyline_length=0;
extern int flag_first_step_continous;
int MAX_DIFF_SPEED=24;
int MAX_SPEED=75;
int MAX_SPEED_TOTAL=99;

int ruka_pozicija=0;
int ruka_zatvorena=50,ruka_otvorena=100;
bool otvori=0,zatvori=0;
//static unsigned char chksum=0,schksum=0;
static int brzina_prim=0;

//flags

static bool flag_SR=FALSE, flag_AR=FALSE, flag_CS=FALSE, flag_following_active=FALSE;

char chksum_reception=0,chksum_transmission=0;
static int byte_count=MAX_TRANSX_LEN;
int c_counter=0;
int diff_brzina=0;
  static float Propc, Difc,err_c=0;
float Intc=0;
    Vector temp;
        Coordinates temp_point;
        
short int Speed1=0, Speed2=0;

int MBEDwatchdog=0;

extern volatile unsigned int Pos1;
extern volatile unsigned int Pos2;
int zapamcena_pozicija_X = 32767;
int zapamcena_pozicija_Y = 32767;

/*TIM4CH1 - senzor nazad, levo. */
unsigned long index_ch1 = 0;         		      // Predstavlja index poslednjeg merenja u nizu merenja.
bool bad_measurement_end_ch1 = FALSE;                 // Jedinica signalizira da nema vise pocetnih, losih merenja.
float distance_bl_ch1 = 0;       		      // Predstavlja izracunatu udaljenost od objekta.
uint16_t measured_distance_bl_ch1[MEASUREMENT_NUM];   // Niz u koji se smestaju izmerene udaljenosti za MEASUREMENT_NUM impulsa.
uint16_t measured_time_bl_rising_ch1 = 0;             // Trenutak kada se desila uzlazna ivica.
uint16_t measured_time_bl_falling_ch1 = 0;            // Trenutak kada se desila silazna ivica.
uint16_t measured_time_bl_ch1 = 0;                    // Vreme trajanje echo signala.
uint8_t state_bl_ch1 = 0;    			      // 0 ako se hvata uzlazna ivica, 1 ako se hvata silazna ivica.
  
/*TIM4CH2 - senzor nazad, desno. */
unsigned long index_ch2 = 0;         		      // Predstavlja index poslednjeg merenja u nizu merenja.
bool bad_measurement_end_ch2 = FALSE;                 // Jedinica signalizira da nema vise pocetnih, losih merenja.
float distance_br_ch2 = 0;       		      // Predstavlja izracunatu udaljenost od objekta.
uint16_t measured_distance_br_ch2[MEASUREMENT_NUM];   // Niz u koji se smestaju izmerene udaljenosti za MEASUREMENT_NUM impulsa.
uint16_t measured_time_br_rising_ch2 = 0;             // Trenutak kada se desila uzlazna ivica.
uint16_t measured_time_br_falling_ch2 = 0;            // Trenutak kada se desila silazna ivica.
uint16_t measured_time_br_ch2 = 0;                    // Vreme trajanje echo signala.
uint8_t state_br_ch2 = 0;    			      // 0 ako se hvata uzlazna ivica, 1 ako se hvata silazna ivica.
  
/*TIM4CH3 - senzor napred desno. */
unsigned long index_ch3 = 0;         		      // Predstavlja index poslednjeg merenja u nizu merenja.
bool bad_measurement_end_ch3 = FALSE;                 // Jedinica signalizira da nema vise pocetnih, losih merenja.
float distance_fr_ch3 = 0;       		      // Predstavlja izracunatu udaljenost od objekta.
uint16_t measured_distance_fr_ch3[MEASUREMENT_NUM];   // Niz u koji se smestaju izmerene udaljenosti za MEASUREMENT_NUM impulsa.
uint16_t measured_time_fr_rising_ch3 = 0;             // Trenutak kada se desila uzlazna ivica.
uint16_t measured_time_fr_falling_ch3 = 0;            // Trenutak kada se desila silazna ivica.
uint16_t measured_time_fr_ch3 = 0;                    // Vreme trajanje echo signala.
uint8_t state_fr_ch3 = 0;    			      // 0 ako se hvata uzlazna ivica, 1 ako se hvata silazna ivica.
  
/* TIM4CH4 - senzor napred levo. */
unsigned long index_ch4 = 0;         		      // Predstavlja index poslednjeg merenja u nizu merenja.
bool bad_measurement_end_ch4 = FALSE;                 // Jedinica signalizira da nema vise pocetnih, losih merenja.
float distance_fl_ch4 = 0;       		      // Predstavlja izracunatu udaljenost od objekta.
uint16_t measured_distance_fl_ch4[MEASUREMENT_NUM];   // Niz u koji se smestaju izmerene udaljenosti za MEASUREMENT_NUM impulsa.
uint16_t measured_time_fl_rising_ch4 = 0;             // Trenutak kada se desila uzlazna ivica.
uint16_t measured_time_fl_falling_ch4 = 0;            // Trenutak kada se desila silazna ivica.
uint16_t measured_time_fl_ch4 = 0;                    // Vreme trajanje echo signala.
uint8_t state_fl_ch4 = 0;                             // 0 ako se hvata uzlazna ivica, 1 ako se hvata silazna ivica.

/* Flag-ovi senzora. */
bool FLAG_sensorEnable = FALSE;                      // Flag koji postavlja glavna ploca i definise da li gledamo senzore ili ne.
bool FLAG_sensorFrontEnable = FALSE;                 // Flag koji se postavlja ili brise na osnovu zadate instrukcije i definise da li gledamo prednje senzore.
bool FLAG_sensorBackEnable = FALSE;                  // Flag koji se postavlja ili brise na osnovu zadate instrukcije i definise da li gledamo zadnje senzore.
bool FLAG_obstacleDetected = FALSE;                 // Flag koji signalizira da je prepreka detektovana. Postavlja se samo prvi put kad je odredjena prepreka detektovana.

void InitTimer6(void);


