praetorian555/Baywatchers/Software/Embedded Software/Motion Board/stm32f10x_it_stu.c
/* Private function prototypes -----------------------------------------------*/
/* Proverava da li je robot stigao na cilj. */
_Bool checkIfAtDest( void );
/* Provera flag-ova senzora i zakljucivanje da li ima prepreke ili ne. */
_Bool checkForObstacle( void );
/* Staje sa lepim usporavanjem ako detekuje prepreku. */
_Bool stopIfObstacle( void );
/* Private functions ---------------------------------------------------------*/

extern  bool running;

/********************************************************************

Funkcija koja racuna apsolutnu poziciju, na osnovu infinitezimalno malih pomeraja motora

***********************************************************************/
/*
absPosition calculatePosition(int Left, int Right){
  static long X=0,Y=0;
  static float Theta=0;
  static unsigned long formerLeft=32767, formerRight=32767;
  absPosition temp;
  int D, dRight, dLeft;
  float dTheta;
  dLeft=(int)(Left-formerLeft);
  dRight=(int)(Right-formerRight);
  
  D=(dLeft+dRight)/2;
  dTheta=(float)(angularConstant*(dLeft-dRight));
  Theta+=dTheta;
  X+=(int)((float)(D*sin(Theta*PI/180)));
  Y+=(int)((float)(D*cos(Theta*PI/180)));
  
  temp.x=X;
  temp.y=Y;
  temp.theta=(((int)(Theta)) >= 0 ? 0 : 360) + ((int)(Theta)) % 360;
  formerLeft=Left;
  formerRight=Right;
  return temp;
}*/

absPosition calculatePosition(int Left, int Right){
  //static long abs_X=0,abs_Y=0;
  //static float abs_Theta=0;
  static unsigned long formerLeft=32767, formerRight=32767;
  absPosition temp;
  int D, dRight, dLeft;
  float dTheta;
  dLeft=(int)(Left-formerLeft);
  dRight=(int)(Right-formerRight);
  
  D=(dLeft+dRight)/2;
  dTheta=(float)(angularConstant*(dLeft-dRight));
  abs_Theta+=dTheta;
  abs_X+=(int)((float)(D*sin(abs_Theta*PI/180)));
  abs_Y+=(int)((float)(D*cos(abs_Theta*PI/180)));
  
  temp.x=abs_X;
  temp.y=abs_Y;
  temp.theta=(((int)(abs_Theta)) >= 0 ? 0 : 360) + ((int)(abs_Theta)) % 360;
  formerLeft=Left;
  formerRight=Right;
  return temp;
}

/******************************************************************************/
/*                 STM32F10x USART Interrupt Handler                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f10x_xx.s).                                            */
/******************************************************************************/

int address;
unsigned int chksum=0,schksum=0;
unsigned char temp_ID;
unsigned char received_byte;
unsigned int received_array[MAX_TRANSX_LEN];

void SendAck(void){
        sending_length=4;
        sending_array[0]=0xFF;
        sending_array[1]=ADDR|0x40;
        sending_array[2]=sending_length-3;        
        schksum=0;
        for(int i=1;i<sending_length-1;i++){
          schksum+=sending_array[i]&0xFF;
        }
        sending_array[3]=schksum&0x7F;//0x4B
        GPIO_SetBits(GPIOC,GPIO_Pin_12); //enejbluje se RS485 predaja
        USART_SendData(USART3,  sending_array[0]);//salje prvi podatak
        sending_iterator=1;
};

//Funkcija za slanje pozicije kada je primljena odgovarajuca komanda
void SendPosition( void )
{ 
  int x_inp, y_inp, xy_inp;
        sending_length=25;
        sending_array[0] = 0xFF;
        sending_array[1] = ADDR|0x40;
        sending_array[2] = sending_length-3;
        sending_array[3] = (apsolutnaPozicija.x & 0x0000000F);
        sending_array[4] = (apsolutnaPozicija.x & 0x000000F0)>>4;
        sending_array[5] = (apsolutnaPozicija.x & 0x00000F00)>>8;
        sending_array[6] = (apsolutnaPozicija.x & 0x0000F000)>>12;
        sending_array[7] = (apsolutnaPozicija.x & 0x000F0000)>>16;
        sending_array[8] = (apsolutnaPozicija.x & 0x00F00000)>>20;
        sending_array[9] = (apsolutnaPozicija.x & 0x0F000000)>>24;
        sending_array[10]=(apsolutnaPozicija.x & 0xF0000000)>>28;
        
        sending_array[11]=(apsolutnaPozicija.y & 0x0000000F);
        sending_array[12]=(apsolutnaPozicija.y & 0x000000F0)>>4;
        sending_array[13]=(apsolutnaPozicija.y & 0x00000F00)>>8;
        sending_array[14]=(apsolutnaPozicija.y & 0x0000F000)>>12;
        sending_array[15]=(apsolutnaPozicija.y & 0x000F0000)>>16;
        sending_array[16]=(apsolutnaPozicija.y & 0x00F00000)>>20;
        sending_array[17]=(apsolutnaPozicija.y & 0x0F000000)>>24;
        sending_array[18]=(apsolutnaPozicija.y & 0xF0000000)>>28;
        
        sending_array[19]=(apsolutnaPozicija.theta & 0x000F);
        sending_array[20]=(apsolutnaPozicija.theta & 0x00F0)>>4;
        sending_array[21]=(apsolutnaPozicija.theta & 0x0F00)>>8;
        sending_array[22]=(apsolutnaPozicija.theta & 0xF000)>>12;
        
        // Ready bit, vraca da li je robot stigao na zeljenu destinaciju
        x_inp=0;
        y_inp=0;
        xy_inp=0;
        if ((trenutna_pozicija_X<zapamcena_pozicija_X+INP_TOLERANCE)&&(trenutna_pozicija_X>zapamcena_pozicija_X-INP_TOLERANCE)) x_inp=1;
        if ((trenutna_pozicija_Y<zapamcena_pozicija_Y+INP_TOLERANCE)&&(trenutna_pozicija_Y>zapamcena_pozicija_Y-INP_TOLERANCE)) y_inp=1;
        if ((x_inp==1)&&(y_inp==1)) {
          xy_inp=1;
        }
        
        sending_array[23]=xy_inp?0x71:0x70;
        
        schksum=0;
        for(int i=1;i<sending_length-1;i++){
          schksum+=sending_array[i]&0xFF;
        }
        sending_array[sending_length-1]=schksum&0x7F;
        
        GPIO_SetBits(GPIOC,GPIO_Pin_12); //enejbluje se RS485 predaja
        USART_SendData(USART3,  sending_array[0]);//salje prvi podatak
        sending_iterator=1;
};

void SendDestFlag( void )
{
  bool arrive_X = FALSE;
  bool arrive_Y = FALSE;
  bool arriveEnable = FALSE;
  int x_inp, y_inp, xy_inp;
  x_inp=0;
  y_inp=0;
  xy_inp=0;
        if ((trenutna_pozicija_X<zapamcena_pozicija_X+INP_TOLERANCE)&&(trenutna_pozicija_X>zapamcena_pozicija_X-INP_TOLERANCE)) x_inp=1;
        if ((trenutna_pozicija_Y<zapamcena_pozicija_Y+INP_TOLERANCE)&&(trenutna_pozicija_Y>zapamcena_pozicija_Y-INP_TOLERANCE)) y_inp=1;
        if ((x_inp==1)&&(y_inp==1)) {
          xy_inp=1;
        }
  if ( xy_inp == 1 ) arriveEnable = TRUE;
  else arriveEnable = FALSE;
  
  /* Zapocinjanje slanja poruke. */
  sending_length = 6;
  sending_array[0]=0xFF;
  sending_array[1]=ADDR|0x40;
  sending_array[2]=sending_length-3;
  sending_array[3] = arriveEnable & 0x0F;
  sending_array[4] = (arriveEnable >> 4) & 0x0F;
  schksum=0;
  for(int i=1;i<sending_length-1;i++) schksum+=sending_array[i]&0xFF;
  sending_array[5]=schksum&0x7F;//0x4B
  GPIO_SetBits(GPIOC,GPIO_Pin_12); //enejbluje se RS485 predaja
  USART_SendData(USART3,  sending_array[0]);//salje prvi podatak
  sending_iterator=1;
}

/**
  *
  */
void Response(void){
  
  unsigned char temp_ID;
  
  /* Dekodovanje poruke. */
  if (address == ADDR)
  {
    switch (received_array[0])
    {
      case 0xE0: komanda = 'a'; break;  //Podesavanje uglovne konstante
      case 0x01: komanda = 'b'; break;  //Setovanje pozicije robota(x, y, ugao)
      case 0xE2: komanda = 'c'; break;  //Reset pozicije na nulu
      case 0x0A: komanda = 'd'; break;  //Emergency stop
      case 0x04: komanda = 'l'; znak = 1; break;  //Kretanje napred
      case 0x05: komanda = 'l'; znak = -1; break; //Kretanje nazad
      case 0x06: komanda = 'r'; znak = 1; break;  //Rotacija desno
      case 0x07: komanda = 'r'; znak = -1; break; //Rotacija levo
      case 0x11: komanda = 's'; break;  // Paljenje senzora                              PITATI JOVICICA!!!
      case 0x12: komanda = 'q'; break;  // Gasenje senzora
      case 0xF7: komanda = 'v'; break;  // Inspektorska, vraca status poruku koja sadrzi poziciju, rotaciju, status robota i ready flag(oznacava da li je robot stigao u zadatu poziciju)
      case 0xFC: komanda='p'; break;    // Inspektorska, vraca da li je robot stigao u zadatu poziciju.
      case 0xFB: komanda = 'z'; break;  //Podesavanje preskalera za brzinu
      case 0xFA: komanda = 'n'; break;  //zaustavi sve....
      default: komanda = 'v'; break;
    };
    
    /* Izvrsavanje instrukcije. */
    
    /* Kretanje napred ili nazad. */
    if (komanda == 'l') {        
        x = znak * (received_array[1] | received_array[2]<<4 | received_array[3]<<8 | received_array[4]<<12);        
        temp_ID=(received_array[5] | received_array[6]<<4);         
        if (temp_ID != command_ID){
          Pos1 = zadata_pozicija_X + x;
          Pos2 = zadata_pozicija_Y + x;
          zadata_pozicija_X = Pos1;
          zadata_pozicija_Y = Pos2;
          zapamcena_pozicija_X = zadata_pozicija_X;
          zapamcena_pozicija_Y = zadata_pozicija_Y;
          if ( znak == 1 )
          {
            FLAG_sensorFrontEnable = TRUE;
            FLAG_sensorBackEnable = FALSE;
          }
          else if ( znak == -1 )
          {
            FLAG_sensorFrontEnable = FALSE;
            FLAG_sensorBackEnable = TRUE;
          }
          command_ID=temp_ID;
        };        
        SendAck();
    }
    /* Rotacija levo ili desno. */
    else if (komanda == 'r') {        
        x = (received_array[1] | received_array[2]<<4 | received_array[3]<<8 | received_array[4]<<12);
        x = x * znak;        
        temp_ID=(received_array[5] | received_array[6]<<4);         
        if (temp_ID!=command_ID){
          Pos1 = zadata_pozicija_X + x;
          Pos2 = zadata_pozicija_Y - x;
          zadata_pozicija_X=Pos1;
          zadata_pozicija_Y=Pos2;
          zapamcena_pozicija_X = zadata_pozicija_X;
          zapamcena_pozicija_Y = zadata_pozicija_Y;
          command_ID=temp_ID;
          
          FLAG_sensorFrontEnable = FALSE;
          FLAG_sensorBackEnable = FALSE;
        };       
        SendAck();
     }
    //Podesavanje preskalera za brzinu
     else if (komanda == 'z') {
        x = (received_array[1] | received_array[2]<<4 | received_array[3]<<8 | received_array[4]<<12);  
        TIM2->PSC=x;
        TIM7->PSC=x;
        SendAck();        
     }
     //Inspektorska, vraca status poruku koja sadrzi poziciju, rotaciju i ready flag(oznacava da li je robot stigao u zadatu poziciju)
     else if (komanda == 'v') {
        SendPosition();
     }
    //Podesavanje uglovne konstante
     else if (komanda == 'a') {
        x = (received_array[1] | received_array[2]<<4 | received_array[3]<<8 | received_array[4]<<12);  
        angularConstant=180/((float)x);
        SendAck();        
     }
     //Setovanje pozicije robota(x, y, ugao)
     else if (komanda == 'b') {        
        abs_X = (received_array[1] | received_array[2]<<4 | received_array[3]<<8 | received_array[4]<<12 | received_array[5]<<16 | received_array[6]<<20 | received_array[7]<<24 | received_array[8]<<28);
        abs_Y = (received_array[9] | received_array[10]<<4 | received_array[11]<<8 | received_array[12]<<12 | received_array[13]<<16 | received_array[14]<<20 | received_array[15]<<24 | received_array[16]<<28);
        abs_Theta = (received_array[17] | received_array[18]<<4 | received_array[19]<<8 | received_array[20]<<12 | received_array[21]<<16 | received_array[22]<<20 | received_array[23]<<24 | received_array[24]<<28);
        SendAck();
     }
     //Reset pozicije na nulu
     else if (komanda == 'c') {        
        abs_X=0;
        abs_Y=0;
        abs_Theta=0;     
        SendAck();
     }
    //Emergency stop
     else if (komanda == 'd') {
        zadata_pozicija_X=trenutna_pozicija_X;
        zadata_pozicija_Y=trenutna_pozicija_Y;
        SendAck();
     }
     /* Paljenje UV senzora. */
     else if(komanda == 's')
     {
       FLAG_sensorEnable = TRUE;
       SendAck();
     }
     /* Gasenje UV senzora. */
     else if(komanda == 'q')
     {
       FLAG_sensorEnable = FALSE;
       SendAck();
     }
     else if(komanda == 'p')
     {
       SendDestFlag();
     }
     else if (komanda == 'n') {
        running=TRUE;
        SendAck();
     }
  }
};


//PITATI JOVICICA
void SendLog(void)
{
        sending_length=4;//sending_length je . pored inforamcionih N informacionih bajtova salje se jos 4 dodatna bajta. dakle ako je max 256 korisnih podataka duzina poruke je 260
        sending_array[0]=0xFF;
        sending_array[1]=ADDR|0x40;
        sending_array[2]=sending_length-3;        
        schksum=0;
        for(int i=1;i<sending_length-1;i++){
          schksum+=sending_array[i]&0xFF;
        }
        sending_array[3]=schksum&0x7F;//0x4B
      
