praetorian555/Baywatchers/Software/Embedded Software/Motion Board/stm32f10x_it_stu.c
        USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);
        USART_ITConfig(USART3, USART_IT_TXE, ENABLE);

};

void SendLogSingle(int index)
{
        sending_length=8;//sending_length je . pored inforamcionih N informacionih bajtova salje se jos 4 dodatna bajta. dakle ako je max 256 korisnih podataka duzina poruke je 260
        sending_array[0]=0xFF;
        sending_array[1]=ADDR|0x40;
        sending_array[2]=sending_length-3;  
     
        sending_array[3]=(data_log[index] & 0x0000000F);
        sending_array[4]=(data_log[index] & 0x000000F0)>>4;
        sending_array[5]=(data_log[index] & 0x00000F00)>>8;
        sending_array[6]=(data_log[index] & 0x0000F000)>>12;   
  
        schksum=0;
        for(int i=1;i<sending_length-1;i++){
          schksum+=sending_array[i]&0xFF;
        }
        sending_array[7]=schksum&0x7F;//0x4B
      
        USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);
        USART_ITConfig(USART3, USART_IT_TXE, ENABLE);
};

void USART3_IRQHandler( void )
{  
  /* Prijem poruke. */
  if((USART_GetITStatus(USART3, USART_IT_RXNE) != RESET))
  {
    USART_ClearITPendingBit(USART3, USART_IT_RXNE);
    received_byte = USART_ReceiveData(USART3);
    if (received_byte==0xFF){
      chksum=0;
      byte_count=0;
      message_size=MAX_TRANSX_LEN;
    }
    else {          
      if (byte_count==0) {//prvi bajt
        address=received_byte;
        chksum=received_byte;
      }
      else if (byte_count==1) {//drugi bajt
        message_size=received_byte;
        chksum=chksum+received_byte;
      }
      else if (byte_count==message_size+1){//poslednji bajt - checksum-a
        //provera checksume
        if ((chksum&0x7F)==received_byte){
          //korektna checksum-a - ide na obradu
          Response();
        }
      }
      else {
        received_array[byte_count-2]=received_byte;  
        chksum=chksum+received_byte;
      }
      if (byte_count<MAX_TRANSX_LEN) byte_count++;
    }    
  }  
  
  /* Slanje poruke. */
  else if ( USART_GetITStatus( USART3, USART_IT_TC ) != RESET ) // Transmit the string in a loop
  {
    USART_ClearITPendingBit( USART3, USART_IT_TC );
    if ( sending_iterator < sending_length )
    {
        USART_SendData( USART3, sending_array[ sending_iterator ] );
        sending_iterator++;
    }
    else 
    {
      sending_iterator = 0;
      GPIO_ResetBits( GPIOC, GPIO_Pin_12 );//disabluje RS485
    }
  }
  
  //PITATI JOVICICA
  else{//ovo je valjda za onu overrun gresku 
    USART_ITConfig(USART3, USART_IT_TC, DISABLE);
    received_byte = USART_ReceiveData(USART3);
    USART3->SR=0x00000000;//D8
    USART_ClearITPendingBit(USART3, USART_IT_TXE);
    USART_ITConfig(USART3, USART_IT_TC, ENABLE);
  }
}

/******************************************************************************/
/*                          STM32F10x EXTI Handler                            */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f10x_xx.s).                                            */
/******************************************************************************/

void EXTI2_IRQHandler(void)
{
  if(EXTI_GetITStatus(EXTI_Line2) != RESET)
  {
    /* Clear the  EXTI line pending bit */
    EXTI_ClearITPendingBit(EXTI_Line2);
    if (GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_2) == 1) {//rastuca ivica
        if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_5) == 1 )
              ENC1--;
        else 
              ENC1++;
    }
    else{
        if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_5) == 1 )
              ENC1++;
        else 
              ENC1--;
    }
  }
  else err++;
}

void EXTI9_5_IRQHandler(void)
{
  
  if (EXTI_GetITStatus(EXTI_Line5) != RESET)
  {
    /* Clear the  EXTI line pending bit */
    EXTI_ClearITPendingBit(EXTI_Line5);
    if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_5) == 1) {//rastuca ivica
        if (GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_2) == 1 )
              ENC1++;
        else 
              ENC1--;
    }
    else{

        if (GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_2) == 1 )
              ENC1--;
        else 
              ENC1++;
    }    
  }
  else err++;
}

void EXTI15_10_IRQHandler(void)
{  
  GPIO_SetBits(GPIOA,GPIO_Pin_5);
  EXTI_InitTypeDef EXTI_InitStructure;
  if (EXTI_GetITStatus(EXTI_Line14) != RESET)
  {
    /* Clear the  EXTI line pending bit */
    EXTI_ClearITPendingBit(EXTI_Line14);            
    if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_14) == 1) {//rastuca ivica
        if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_15) == 1 )
              ENC2++;
        else 
              ENC2--;
    }
    else{

        if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_15) == 1 )
              ENC2--;
        else 
              ENC2++;
    }    
  }
  else if (EXTI_GetITStatus(EXTI_Line15) != RESET)
  {
    /* Clear the  EXTI line pending bit */
    EXTI_ClearITPendingBit(EXTI_Line15);            
    if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_15) == 1) {//rastuca ivica
        if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_14) == 1 )
              ENC2--;
        else 
              ENC2++;
    }
    else{
        if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_14) == 1 )
              ENC2++;
        else 
              ENC2--;
    }
  }
  else err++;
  GPIO_ResetBits(GPIOA,GPIO_Pin_5);
}
/******************************************************************************/
/*            Cortex-M3 Processor Exceptions Handlers                         */
/******************************************************************************/

/**
* @brief  This function handles NMI exception.
* @param  None
* @retval None
*/
void NMI_Handler(void)
{
}

/**
* @brief  This function handles Hard Fault exception.
* @param  None
* @retval None
*/
void HardFault_Handler(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}

/**
* @brief  This function handles Memory Manage exception.
* @param  None
* @retval None
*/
void MemManage_Handler(void)
{
  /* Go to infinite loop when Memory Manage exception occurs */
  while (1)
  {
  }
}

/**
* @brief  This function handles Bus Fault exception.
* @param  None
* @retval None
*/
void BusFault_Handler(void)
{
  /* Go to infinite loop when Bus Fault exception occurs */
  while (1)
  {
  }
}

/**
* @brief  This function handles Usage Fault exception.
* @param  None
* @retval None
*/
void UsageFault_Handler(void)
{
  /* Go to infinite loop when Usage Fault exception occurs */
  while (1)
  {
  }
}



/**
* @brief  This function handles SVCall exception.
* @param  None
* @retval None
*/
void SVC_Handler(void)
{
}

/**
* @brief  This function handles Debug Monitor exception.
* @param  None
* @retval None
*/
void DebugMon_Handler(void)
{
}

/**
* @brief  This function handles PendSV_Handler exception.
* @param  None
* @retval None
*/
void PendSV_Handler(void)
{
}

/******************************************************************************/
/*                 STM32F10x Peripherals Interrupt Handlers                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f10x_xx.s).                                            */
/******************************************************************************/

/**
* @brief  This function handles PPP interrupt request.
* @param  None
* @retval None
*/


//f-ja za prijem sa uarta



void SysTick_Handler(void)
{
  int pwm_command;
  //TIM_ClearFlag(TIM2, TIM_FLAG_Update);
  
  //svakih 10ms tajmer 2 inkrementira neki pomocni brojac
  //ako brojac dodje do timeout vrednosti gase se motori
  //u suprotnom se ne gase
  //prijemnik uart-a resetuje brojac na nulu
    
   /* if(MBEDwatchdog<12){
      MBEDwatchdog++;
    }
    else {
      Speed1=0;
      Speed2=0;
    }*/
  

  if (neki_brojac>1){
    apsolutnaPozicija=calculatePosition(ENC1, ENC2);
    neki_brojac=0;
  }
  else
  {
    neki_brojac++;
  }
  
  if(flag_c==1){
    int Motor1=0,Motor2=0,MotorJaciDelta=0;

    temp.origin=polyline_path[c_counter];
    temp.point=polyline_path[c_counter+1];
    temp_point.x=apsolutnaPozicija.x;
    temp_point.y=apsolutnaPozicija.y;
    if(flag_first_step_continous && (advanced_segment_stigao==1)){
      float proba;

      proba=angular_Displacement(temp);
      Pos1=ENC1-(float)(UTC*(angular_Displacement(temp)+apsolutnaPozicija.theta));
      Pos2=ENC2+ENC1-Pos1;
      flag_following_active=FALSE;
    }else if(flag_following_active){
      MAX_SPEED=75;
      MAX_DIFF_SPEED=24;
      MAX_SPEED_TOTAL=MAX_SPEED+MAX_DIFF_SPEED;
      float till_end=0;
      stigao=0;
      till_end=point_Projection(temp_point, temp)-Intensity(temp);
    if(till_end>-4000){
        if(c_counter==polyline_length-2)
        {
            MAX_SPEED=(float)(-0.005*till_end+55);

