praetorian555/Baywatchers/Software/Embedded Software/Motion Board/stm32f10x_it_stu.c
        }
        else{
            MAX_SPEED=(float)(-0.005*till_end+55);
        }
            MAX_DIFF_SPEED=MAX_SPEED-51;
            MAX_SPEED_TOTAL=MAX_SPEED+MAX_DIFF_SPEED;
      }
      if(neki_brojac==2){
        
        err_c=point_To_Vector(temp_point, temp);
        diff_brzina=PID_continous(err_c);
      }
      Motor1=10*MAX_SPEED+10*diff_brzina;
      Motor2=10*MAX_SPEED-10*diff_brzina;
      MotorJaciDelta=Motor1>Motor2?(10*MAX_SPEED_TOTAL-Motor1):(10*MAX_SPEED_TOTAL-Motor2);
   

      TIM1->CCR1 = 10*MAX_SPEED+10*diff_brzina+MotorJaciDelta;
      TIM1->CCR2 = 10*MAX_SPEED-10*diff_brzina+MotorJaciDelta;
      if((point_Projection(temp_point, temp)>Intensity(temp))&&(c_counter<polyline_length)){ // bilo polyline_length-1
        c_counter++;
        return;
      }
//      if((Distance(temp_point, temp.point)<2000)&&(c_counter==polyline_length-1)){ // bilo polyline_length-1
//        c_counter++;
//        return;
//      }
     
      if(c_counter==polyline_length-1){
        ENC1_old = ENC1;
        ENC2_old = ENC2;
        Pos1=ENC1;
        Pos2=ENC2;
        flag_c=0;
        stigao=advanced_segment_stigao;
        c_counter=0;
        flag_first_step_continous=1;
        return;
      }
      ENC1_old = ENC1;
      ENC2_old = ENC2;     
      GPIO_SetBits(GPIOB, GPIO_Pin_15);//ENABLE M2
      
      GPIO_SetBits(GPIOB, GPIO_Pin_12);
      
      return;
      
    }
    
  }
  
  
  //brzina=PID_poz_NELIN(Pos1,ENC1);
  //brzina=PID_poz(Pos1,ENC1);
  brzina=PID_poz(trenutna_pozicija_X,ENC1);
  //brzina=Speed_profile_X(Pos1,ENC1); 
  //brzina=Speed1;
  brzina_prim=brzina;
  err = ENC1-ENC1_old;
  pwm_command = PID1(brzina,err);
  if (pwm_command>100){
    GPIO_ResetBits(GPIOA,GPIO_Pin_4);
    GPIO_SetBits(GPIOA,GPIO_Pin_10);
  }
  else if (pwm_command<-100){
    GPIO_SetBits(GPIOA,GPIO_Pin_4);
    GPIO_ResetBits(GPIOA,GPIO_Pin_10);
    pwm_command=-pwm_command;
  }
  else {
    GPIO_ResetBits(GPIOA,GPIO_Pin_4);
    GPIO_ResetBits(GPIOA,GPIO_Pin_10);
    pwm_command=990;
  };
  TIM1->CCR2 = 1000-pwm_command;
  ENC1_old = ENC1;
  stigao1 = (brzina==0);
  
  //brzina=PID_poz_NELIN(Pos2,ENC2);  // naci u ccr1 idje brzina koju zelis da ostvaris
  //brzina=PID_poz(Pos2,ENC2);
  brzina=PID_poz(trenutna_pozicija_Y,ENC2);
  //brzina=Speed_profile_Y(Pos2,ENC2);
  //brzina=Speed2;
  err = ENC2-ENC2_old;  
  pwm_command = PID2(brzina,err);
  if (pwm_command>100){
    GPIO_SetBits(GPIOC,GPIO_Pin_9);
    GPIO_ResetBits(GPIOC,GPIO_Pin_8);
  }
  else if (pwm_command<-100){
    GPIO_ResetBits(GPIOC,GPIO_Pin_9);
    GPIO_SetBits(GPIOC,GPIO_Pin_8);
    pwm_command=-pwm_command;
  }
  else {
    GPIO_ResetBits(GPIOC,GPIO_Pin_9);
    GPIO_ResetBits(GPIOC,GPIO_Pin_8);
    pwm_command=990;
  };
  TIM1->CCR1=1000-pwm_command;
  ENC2_old = ENC2;
  
  
  advanced_segment_stigao=stigao1&&(brzina==0);
  if ((flag_a==1)||(flag_c==1)){
  }
  else
  {
    stigao = advanced_segment_stigao;
  }
  
  if (advanced_segment_stigao == 1)
  { 
    
    if ((flag_a==1))
    {
      putanja_counter++;
      Pos1=putanja[putanja_counter][0];
      Pos2=putanja[putanja_counter][1];
      

      if (putanja_counter>=ulm_length){
        stigao=advanced_segment_stigao;
        flag_a=0;
        putanja_counter=0;
        ulm_length=0;
      }
    }
  }
  if(flag_first_step_continous&&(flag_following_active==FALSE)&&advanced_segment_stigao){
    flag_first_step_continous=FALSE;
    flag_following_active=TRUE;
  }
  
  //USART_SendData(USART3, err);
  //USART_SendData(USART3, ((brzina == 0) ? 43 : 91));
  
  if ((brzina==0)){
    //GPIO_ResetBits(GPIOB, GPIO_Pin_12);//DISABLE M1
    GPIO_ResetBits(GPIOB, GPIO_Pin_15);//DISABLE M2
  }
  else {
    //GPIO_SetBits(GPIOB, GPIO_Pin_12);//ENABLE M1
    GPIO_SetBits(GPIOB, GPIO_Pin_15);//ENABLE M2
  };
  if ((brzina_prim==0)){
    GPIO_ResetBits(GPIOB, GPIO_Pin_12);//DISABLE M1
    //GPIO_ResetBits(GPIOB, GPIO_Pin_15);//DISABLE M2
  }
  else {
    GPIO_SetBits(GPIOB, GPIO_Pin_12);//ENABLE M1
    //GPIO_SetBits(GPIOB, GPIO_Pin_15);//ENABLE M2
  };
  
  /*if(otvori&&(ruka_pozicija<ruka_otvorena)){
    ruka_pozicija++;
    TIM3->CCR3=ruka_pozicija;
  } else if(zatvori&&(ruka_pozicija>ruka_zatvorena)){
    ruka_pozicija--;
    TIM3->CCR3=ruka_pozicija;
  }else{
    otvori=zatvori=0;
  }*/
} 

int CTPWM(int crtice){
  return crtice;
}
int PWMTC(int pwm){
  return pwm;
}
int PID_continous(float gr){
  static float Kpc=0.03, Kic=0, Kdc=0.7, Kac=0.5;
  static int counter=0;
  static float delta_err,err_previous=0;
  float Propc, Difc, Propac;
  int  Reg;
 // float anglePID=0, formerAnglePID, deltaAngle;
 // formerAnglePID=anglePID;
  counter++;
 // anglePID=((int)(angular_Displacement(temp)+apsolutnaPozicija.theta+720))%360;
 // anglePID=anglePID<180?anglePID:(anglePID-360);
//  deltaAngle=anglePID-formerAnglePID;
  delta_err = gr-err_previous;
  Propc =Kpc * (float)gr;
//  Propac=(float)(Kac*(deltaAngle>10?deltaAngle:0));
  Difc = Kdc * (float)(delta_err);
//  Intc=Intc+(float)(Kic*Propc)+Propac;
  if(Intc>MAX_DIFF_SPEED)Intc=MAX_DIFF_SPEED;
  if(Intc<-MAX_DIFF_SPEED)Intc=-MAX_DIFF_SPEED;
  //if ((gr>0?gr:-gr)<30){ Intc=0;}
  Reg = (int)(Propc + Difc + Intc);
  if (Reg>MAX_DIFF_SPEED) Reg=MAX_DIFF_SPEED;
  if (Reg<-MAX_DIFF_SPEED) Reg=-MAX_DIFF_SPEED;
  err_previous=gr;
  return Reg;  
}
int PID1(int zeljena, int trenutna)
{
  int greska, Reg;
  int speed;
  float Prop,Dif;
  greska = zeljena-trenutna;
  Prop = Kp * (float)greska;
  Dif = Kd * (float)(greska - prethodna_greska1);
  //if (((greska - prethodna_greska1)>-2)&&((greska - prethodna_greska1)<2)) Int1=0;
  //if ((greska >-4)&&(greska<4)&&(Int1>0)) Int1=Int1-4*Ki;
  //if ((greska >-4)&&(greska<4)&&(Int1<0)) Int1=Int1+4*Ki;
  Int1 += Ki * (float)(greska); // integral part
  if (Int1>900) Int1=900;
  if (Int1<-900) Int1=-900;
  Reg = (int)(Prop + Dif + Int1);
  if (Reg>990) Reg=990;
  if (Reg<-990) Reg=-990; 
  //if ((greska ==0)&&(speed_current_X==0)) {Reg=0; Int1=0;}
  if ((greska<1)&&(greska>-1)&&(speed_current_X==0)) {Reg=0; Int1=0;}
  prethodna_greska1=greska;
  //return (Reg-500)*SCALE+500;
  
  return Reg;  
}

int PID2(int zeljena, int trenutna)
{
  int greska, Reg;
  float Prop,Dif;
  greska = zeljena-trenutna;
  Prop = Kp * (float)greska;
  Dif = Kd * (float)(greska - prethodna_greska2);
  //if ((greska<2)&&(greska>-2)) Int2=0;
  Int2 += Ki * (float)(greska); // integral part
  if (Int2>900) Int2=900;
  if (Int2<-900) Int2=-900;
  Reg = (int)(Prop + Dif + Int2);
  if (Reg>990) Reg=990;
  if (Reg<-990) Reg=-990;  
  //if ((greska ==0)&&(greska==prethodna_greska2)) {Reg=0; Int2=0;}
  //if ((greska ==0)&&(speed_current_Y==0)) {Reg=0; Int2=0;}
  if ((greska<1)&&(greska>-1)&&(speed_current_Y==0)) {Reg=0; Int2=0;}
  prethodna_greska2=greska;
  //return (Reg-500)*SCALE+500;  
  return Reg; 
}



