praetorian555/Baywatchers/Software/Embedded Software/Motion Board/stm32f10x_it_stu.c
/*
int PID_poz(int zeljena, int trenutna)
{
int greska, Reg;
float Prop,Dif;
greska = zeljena-trenutna;
Prop = Kp_poz * (float)greska;
Dif = Kd_poz * (float)(greska - prethodna_greska);
Int_poz += Ki_poz * (float)(greska); // integral part
if (Int_poz>50) Int_poz=50;
if (Int_poz<-50) Int_poz=-50;
Reg = (int)(Prop + Dif + Int_poz);
if (Reg>100) Reg=100;
if (Reg<-100) Reg=-100;
prethodna_greska_poz=greska;
return Reg;  
}*/

int PID_poz_NELIN(int zeljena, int trenutna)
{
  int greska, Reg;
  float Prop,Dif;
  greska = zeljena-trenutna;
  if (greska>speed_ref_pos[9]) return 100*SCALE;
  else if (greska>speed_ref_pos[8]) return 90*SCALE; 
  else if (greska>speed_ref_pos[7]) return 80*SCALE; 
  else if (greska>speed_ref_pos[6]) return 70*SCALE; 
  else if (greska>speed_ref_pos[5]) return 60*SCALE; 
  else if (greska>speed_ref_pos[4]) return 50*SCALE; 
  else if (greska>speed_ref_pos[3]) return 40*SCALE; 
  else if (greska>speed_ref_pos[2]) return 30*SCALE; 
  else if (greska>speed_ref_pos[2]) return 20*SCALE;
  else if (greska>speed_ref_pos[0]) return 10*SCALE; 
  else if (greska>0) return 0;  
  
  greska=-greska;
  if (greska>speed_ref_pos[9]) return -100*SCALE;
  else if (greska>speed_ref_pos[8]) return -90*SCALE; 
  else if (greska>speed_ref_pos[7]) return -80*SCALE; 
  else if (greska>speed_ref_pos[6]) return -70*SCALE; 
  else if (greska>speed_ref_pos[5]) return -60*SCALE; 
  else if (greska>speed_ref_pos[4]) return -50*SCALE; 
  else if (greska>speed_ref_pos[3]) return -40*SCALE; 
  else if (greska>speed_ref_pos[2]) return -30*SCALE; 
  else if (greska>speed_ref_pos[1]) return -20*SCALE;
  else if (greska>speed_ref_pos[0]) return -10*SCALE; 
  else return 0;   
  
}

int PID_poz(int zeljena, int trenutna)
{
  int greska, Reg;
  float Prop,Dif;
  greska = zeljena-trenutna;
  Reg=SCALE*greska/12;
  //if (Reg>90) Reg=90;
  //if (Reg<-90) Reg=-90;
  return Reg; 
}

/**
  * @brief  Proverava da li je robot stigao na cilj.
  * @param  Nema ulaznih argumenata.
  * @retval Vraca TRUE ako je robot stigao na cilj inace vraca FALSE.
  * @author Praetorian ( archmarko92@gmail.com )
  */
_Bool checkIfAtDest( void )
{
  /* Definisanje okoline cilja u kojoj se smatra da je motor stigao na cilj. */
  int dest_low_bound_m1 = zadata_pozicija_X - PROXIMITY_CONSTANT;
  int dest_high_bound_m1 = zadata_pozicija_X + PROXIMITY_CONSTANT;
  int dest_low_bound_m2 = zadata_pozicija_Y - PROXIMITY_CONSTANT;
  int dest_high_bound_m2 = zadata_pozicija_Y + PROXIMITY_CONSTANT;
  
  
  /* Provera da li smo stigli na cilj. */
  if ( trenutna_pozicija_X >= dest_low_bound_m1 && trenutna_pozicija_X <= dest_high_bound_m1 &&
       trenutna_pozicija_Y >= dest_low_bound_m2 && trenutna_pozicija_Y <= dest_high_bound_m2 ) return TRUE;
  else return FALSE;
  
}
/*----------------------------------------------------------------------------*/

/**
  * @brief  Proverava senzore da li je detektovana prepreka i vraca TRUE ako jeste.
  * @param  Nema ulaznih argumenata.
  * @retval Vraca TRUE ako je prepreka detektovana inace vraca FALSE.
  * @author Praetorian ( archmarko92@gmail.com )
  */
_Bool checkForObstacle( void )
{
  /* Deaktiviranje flag-a koji signalizira detektovanu prepreku ako smo stigli na poziciju, inace ga ne diramo. */
  if( checkIfAtDest() ) FLAG_obstacleDetected = FALSE;
  
  /* Provera da li se senzori gledaju. */
  if( FLAG_sensorEnable )
  {
    /* Provera da li se gledaju prednji senzori. */
    if( FLAG_sensorFrontEnable )
    {
      if( ( ( distance_fr_ch3 <= MAX_DISTANCE_MM ) || ( distance_fl_ch4 <= MAX_DISTANCE_MM ) ) && !FLAG_obstacleDetected )
         return TRUE;
      else
         return FALSE;
    }
    
    /* Provera da li se gledaju zadnji senzori. */
    else if( FLAG_sensorBackEnable )
    {
      if( ( ( distance_bl_ch1 <= MAX_DISTANCE_MM ) || ( distance_br_ch2 <= MAX_DISTANCE_MM ) ) && !FLAG_obstacleDetected )
         return TRUE;
      else
         return FALSE;
    }
    
    /* Nijedni senzori se ne gledaju. */
    else return FALSE;
  }
  
  /* Ne gledaju se senzori. */
  else return FALSE;
              
}
/*----------------------------------------------------------------------------*/
              

/**
  * @brief  Staje sa lepim usporavanjem ako detekuje prepreku.
  * @param  Nema ulaznih argumenata.
  * @retval Vraca TRUE ako se staje usled prepreke, inace se vraca FALSE.
  * @author Praetorian ( archmarko92@gmail.com )
  */
_Bool stopIfObstacle( void )     
{
   /* Ako je detekovana prepreka zapocni zaustavljanje. */
   if( checkForObstacle() && !checkIfAtDest() )
   { 
     
     /* Provera da li se robot krece napred. */
     if( zadata_pozicija_X > trenutna_pozicija_X && zadata_pozicija_Y > trenutna_pozicija_Y )
     {
       FLAG_obstacleDetected = TRUE;
       zapamcena_pozicija_X = zadata_pozicija_X;
       zapamcena_pozicija_Y = zadata_pozicija_Y;
       zadata_pozicija_X = trenutna_pozicija_X + STOP_DISTANCE;
       zadata_pozicija_Y = trenutna_pozicija_Y + STOP_DISTANCE;
       return TRUE;
     }
     
     /* Provera da li se robot krece unazad. */
     else if ( zadata_pozicija_X < trenutna_pozicija_X && zadata_pozicija_Y < trenutna_pozicija_Y )
     {
       FLAG_obstacleDetected = TRUE;
       zapamcena_pozicija_X = zadata_pozicija_X;
       zapamcena_pozicija_Y = zadata_pozicija_Y;
       zadata_pozicija_X = trenutna_pozicija_X - STOP_DISTANCE;
       zadata_pozicija_Y = trenutna_pozicija_Y - STOP_DISTANCE;
       return TRUE;
     }
     
     /* Ne radi nista ako je rotaciono kretanje. */
     else return FALSE;
   }
   
   /* Ako je detektovana prepreka a u poziciji smo. */
   else if( !checkForObstacle() && checkIfAtDest() )
   {
     zadata_pozicija_X = zapamcena_pozicija_X;
     zadata_pozicija_Y = zapamcena_pozicija_Y;
   }
   
   /* Ako nije detekovana prepreka ne radi nista. */
   else return FALSE;
}
/*----------------------------------------------------------------------------*/

/**
  * @brief  Prekidna rutina tajmera 4. Merenje udaljenosti od objekata pomocu
  *         ultrazvucnih senzora.
  * @param  Nema ulaznih argumenata.
  * @retval Nema izlaznih argumenata.
  * @author Milica Stojiljkovic
  */
void TIM4_IRQHandler( void )
{
  /* Provera da li je stigao zahtev za prekid od kanala 1. Senzor nazad, levo. */
  if ( TIM_GetITStatus( TIM4, TIM_IT_CC1 ) == SET )
  {
    TIM_ClearITPendingBit( TIM4, TIM_IT_CC1 );
    
    /* Masina stanja za racunanje udaljenosti prepreke od senzora. */
    switch( state_bl_ch1 )
    {
      /* Hvatanje uzlazne ivice. */
      case 0: 
        
          measured_time_bl_rising_ch1 = TIM_GetCapture1( TIM4 );
          TIM_OC1PolarityConfig( TIM4, TIM_ICPolarity_Falling );
          state_bl_ch1 = 1;
          break;
      
