praetorian555/Baywatchers/Software/Embedded Software/Motion Board/stm32f10x_it_stu.c
      /* Hvatanje silazne ivice. */
      case 1:
        
          measured_time_bl_falling_ch1 = TIM_GetCapture1( TIM4 );
          TIM_OC1PolarityConfig( TIM4, TIM_ICPolarity_Rising );  // sada hvatamo uzlaznu ivicu
          state_bl_ch1 = 0;
          
          /* Racunanje udaljenosti objekta od senzora. */
          if( measured_time_bl_falling_ch1 > measured_time_bl_rising_ch1 )
               measured_time_bl_ch1 = measured_time_bl_falling_ch1 - measured_time_bl_rising_ch1;
          else measured_time_bl_ch1 = ECHO_TIMER_PERIOD - measured_time_bl_rising_ch1 + measured_time_bl_falling_ch1;
          
          /* Novu izmerenu vrednost dodajemo u niz. */
          measured_distance_bl_ch1[ ( index_ch1++ ) % MEASUREMENT_NUM ] =  measured_time_bl_ch1; 
          
          /* Provera da li smo prosli prvih par losih merenja. */
          if ( index_ch1 > MEASUREMENT_NUM ) bad_measurement_end_ch1 = TRUE;
          
          /* Ako smo prosli prvih par losih merenja, mozemo da racunamo udaljenost od objekta. */
          if ( bad_measurement_end_ch1 )
          {
            int temp_distance = 0;
            for ( int j = 0; j < MEASUREMENT_NUM; j++ ) temp_distance += measured_distance_bl_ch1[ j ];
            distance_bl_ch1 = temp_distance / MEASUREMENT_NUM;
            distance_bl_ch1 /= CONST_MICRO_SEC_TO_MM;
          }
          else
          {
            distance_bl_ch1 = measured_distance_bl_ch1[ index_ch1 ] / CONST_MICRO_SEC_TO_MM;
          }
          
          break;
          
          
       default:
        
          break; 
    }
  }
  
  
  /* Provera da li je stigao zahtev za prekid od kanala 2. Senzor nazad, desno. */
  else if ( TIM_GetITStatus( TIM4, TIM_IT_CC2 ) == SET )
  {
    TIM_ClearITPendingBit( TIM4, TIM_IT_CC2 );
    
    /* Masina stanja za racunanje udaljenosti prepreke od senzora. */
    switch(state_br_ch2)
    {
      /* Hvatanje uzlazne ivice. */
      case 0: 
      {
          measured_time_br_rising_ch2 = TIM_GetCapture2( TIM4 );
          TIM_OC2PolarityConfig( TIM4, TIM_ICPolarity_Falling );
          state_br_ch2 = 1;
          break;
      }
      
      /* Hvatanje silazne ivice. */
      case 1:
        
          measured_time_br_falling_ch2 = TIM_GetCapture2( TIM4 );
          TIM_OC2PolarityConfig( TIM4, TIM_ICPolarity_Rising );  // sada hvatamo uzlaznu ivicu
          state_br_ch2 = 0;
          
          /* Racunanje udaljenosti objekta od senzora. */
          if( measured_time_br_falling_ch2 > measured_time_br_rising_ch2 )
               measured_time_br_ch2 = measured_time_br_falling_ch2 - measured_time_br_rising_ch2;
          else measured_time_br_ch2 = ECHO_TIMER_PERIOD - measured_time_br_rising_ch2 + measured_time_br_falling_ch2;
          
          /* Novu izmerenu vrednost dodajemo u niz. */
          measured_distance_br_ch2[ ( index_ch2++ ) % MEASUREMENT_NUM ] =  measured_time_br_ch2; 
          
          /* Provera da li smo prosli prvih par losih merenja. */
          if ( index_ch2 > MEASUREMENT_NUM ) bad_measurement_end_ch2 = TRUE;
          
          /* Ako smo prosli prvih par losih merenja, mozemo da racunamo udaljenost od objekta. */
          if ( bad_measurement_end_ch2 )
          {
            int temp_distance = 0;
            for ( int j = 0; j < MEASUREMENT_NUM; j++ ) temp_distance += measured_distance_br_ch2[ j ];
            distance_br_ch2 = temp_distance / MEASUREMENT_NUM;
            distance_br_ch2 /= CONST_MICRO_SEC_TO_MM;
          }
          else
          {
            distance_br_ch2 = measured_distance_br_ch2[ index_ch2 ] / CONST_MICRO_SEC_TO_MM;
          }
          
          break;
          
          
       default:
        
          break; 
    }
  }
  
  
  /* Provera da li je stigao zahtev za prekid od kanala 3. Senzor napred, desno. */
  else if ( TIM_GetITStatus(TIM4, TIM_IT_CC3) == SET )
  {
    TIM_ClearITPendingBit( TIM4, TIM_IT_CC3 );
    
    /* Masina stanja za racunanje udaljenosti prepreke od senzora. */
    switch( state_fr_ch3 )
    {
      /* Hvatanje uzlazne ivice. */
      case 0: 
      {
          measured_time_fr_rising_ch3 = TIM_GetCapture3( TIM4 );
          TIM_OC3PolarityConfig( TIM4, TIM_ICPolarity_Falling ); // sada hvatamo silaznu ivicu
          state_fr_ch3 = 1;
          break;
      }
        
      /* Hvatanje silazne ivice. */
      case 1:
          measured_time_fr_falling_ch3 = TIM_GetCapture3( TIM4 );
          TIM_OC3PolarityConfig( TIM4, TIM_ICPolarity_Rising );  // sada hvatamo uzlaznu ivicu
          state_fr_ch3 = 0;
          
          /* Racunanje udaljenosti objekta od senzora. */
          if( measured_time_fr_falling_ch3 > measured_time_fr_rising_ch3 )
               measured_time_fr_ch3 = measured_time_fr_falling_ch3 - measured_time_fr_rising_ch3;
          else measured_time_fr_ch3 = ECHO_TIMER_PERIOD - measured_time_fr_rising_ch3 + measured_time_fr_falling_ch3;
          
          /* Novu izmerenu vrednost dodajemo u niz. */
          measured_distance_fr_ch3[ ( index_ch3++ ) % MEASUREMENT_NUM ] =  measured_time_fr_ch3; 
          
          /* Provera da li smo prosli prvih par losih merenja. */
          if ( index_ch3 > MEASUREMENT_NUM ) bad_measurement_end_ch3 = TRUE;
          
          /* Ako smo prosli prvih par losih merenja, mozemo da racunamo udaljenost od objekta. */
          if ( bad_measurement_end_ch3 )
          {
            int temp_distance = 0;
            for ( int j = 0; j < MEASUREMENT_NUM; j++ ) temp_distance += measured_distance_fr_ch3[ j ];
            distance_fr_ch3 = temp_distance / MEASUREMENT_NUM;
            distance_fr_ch3 /= CONST_MICRO_SEC_TO_MM;
          }
          else
          {
            distance_fr_ch3 = measured_distance_fr_ch3[ index_ch3 ] / CONST_MICRO_SEC_TO_MM;
          }
          
          break;
          
          
       default:
        
          break; 
    }
  }
  
  
  /* Provera da li je stigao zahtev za prekid od kanala 4. Senzor napred, levo. */
  else if ( TIM_GetITStatus( TIM4, TIM_IT_CC4 ) == SET )
  {
    TIM_ClearITPendingBit( TIM4, TIM_IT_CC4 );
    
    /* Masina stanja za racunanje udaljenosti prepreke od senzora. */
    switch( state_fl_ch4 )
    {
      /* Hvatanje uzlazne ivice. */
      case 0: 
      {
          measured_time_fl_rising_ch4 = TIM_GetCapture4( TIM4 );
          TIM_OC4PolarityConfig( TIM4, TIM_ICPolarity_Falling ); // sada hvatamo silaznu ivicu
          state_fl_ch4 = 1;
          break;
      }
      
