praetorian555/Baywatchers/Software/Embedded Software/Motion Board/stm32f10x_it_stu.c
      /* Hvatanje silazne ivice. */
      case 1:
        
          measured_time_fl_falling_ch4 = TIM_GetCapture4( TIM4 );
          TIM_OC4PolarityConfig( TIM4, TIM_ICPolarity_Rising );  // sada hvatamo uzlaznu ivicu
          state_fl_ch4 = 0;
          
          /* Racunanje udaljenosti objekta od senzora. */
          if( measured_time_fl_falling_ch4 > measured_time_fl_rising_ch4 )
               measured_time_fl_ch4 = measured_time_fl_falling_ch4 - measured_time_fl_rising_ch4;
          else measured_time_fl_ch4 = ECHO_TIMER_PERIOD - measured_time_fl_rising_ch4 + measured_time_fl_falling_ch4;
          
          /* Novu izmerenu vrednost dodajemo u niz. */
          measured_distance_fl_ch4[ ( index_ch4++ ) % MEASUREMENT_NUM ] =  measured_time_fl_ch4; 
          
          /* Provera da li smo prosli prvih par losih merenja. */
          if ( index_ch4 > MEASUREMENT_NUM ) bad_measurement_end_ch4 = TRUE;
          
          /* Ako smo prosli prvih par losih merenja, mozemo da racunamo udaljenost od objekta. */
          if ( bad_measurement_end_ch4 )
          {
            int temp_distance = 0;
            for ( int j = 0; j < MEASUREMENT_NUM; j++ ) temp_distance += measured_distance_fl_ch4[ j ];
            distance_fl_ch4 = temp_distance / MEASUREMENT_NUM;
            distance_fl_ch4 /= CONST_MICRO_SEC_TO_MM;
          }
          else
          {
            distance_fl_ch4 = measured_distance_fl_ch4[ index_ch4 ] / CONST_MICRO_SEC_TO_MM;
          }
          
          break;
          
          
       default:
        
          break; 
    }
  }
  
  
  /* Provera da li je detektovana prepreka i da li treba stati posle svakog novog merenja. */
  stopIfObstacle();
  
}
/******************************************************************************/
/*            STM32F10x Peripherals Interrupt Handlers                        */
/******************************************************************************/

/**
* @brief  This function handles External line0 interrupt request.
* @param  None
* @retval None
*/


/**
  * @brief  Prekidna rutina tajmera 4. Merenje udaljenosti od objekata pomocu
  *         ultrazvucnih senzora.
  * @param  Nema ulaznih argumenata.
  * @retval Nema izlaznih argumenata.
  * @author Milica Stojiljkovic
  */
void TIM6_DAC_IRQHandler( void )
{
  /* Provera da li je stigao zahtev za prekid od kanala 1. Senzor nazad, levo. */
  if ( TIM_GetITStatus( TIM6, TIM_IT_Update ) == SET )
  {
    TIM_ClearITPendingBit( TIM6, TIM_IT_Update );
    if(cnt_90 == 90) running = FALSE;
    else cnt_90++;

  }
}
/******************************************************************************/

/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
